
const quizData = [
    {
         question: "1.Дараах зүйлсийн аль нь улс төрд бизнесийн оролцоог эсэргүүцэх аргумент биш вэ??",
         a: "Бизнесийн менежерүүд улс төрд чадварлаг биш",
         b: "Улс төрд оролцдог бизнес эрхлэгчид итгэл үнэмшилээ эрсдэлд оруулдаг", 
         c: "Бизнес нь нийтлэг сайн сайхны төлөө санаа зовох зүйлгүй байдаг", 
         d: " Бизнес эрхлэгчид улс төрийн үйл явцад оролцох нь хууль бус юм",
         correct: "d"
    },
    {
        question: "2.Дараах ёс зүйн онолуудын аль нь хүний зан чанар, нэр хүндийг түүний үйлдлээс илүү үнэлдэг вэ?",
         a: "Ёс зүйн хамаарал",
         b: "Виртуал ёс зүй", 
         c: "Ёс суртахууны абсолютизм", 
         d: "Ёс зүй",
         correct: "b",
    },
    {
        question: "3.Дараах зүйлсийн аль нь популизмд тохиолддог вэ?",
        a: "Жирийн хүн бизнес эрхлэгчид ба засгийн газрыг хамгаалах ёстой зүйл гэж үздэг",
        b: "Нийтлэг хүн хөрөнгийн биржийн зах зээл, эдийн засгийн бүх төлөвлөлтийг эсэргүүцдэг", 
        c: "Бизнес эрхлэгчид ба засгийн газар нийтлэг хүнд аюулгүй байдлыг санал болгодог", 
        d: "Олон нийт хөрөнгийн зах зээл, засгийн газрын зохицуулалтыг үнэлдэг",
        correct: "a",
    },
    {
        question: "4.Дараахь сонголтуудын аль нь компаниуд буяны үүргээ биелүүлэх арга замыг илэрхийлдэг вэ?",
         a: "Бүх хууль тогтоомжийг дагаж мөрдөх",
         b: "Байгаль орчинд туслах зорилгоор мөнгө хандивлаж байна", 
         c: "Бизнесийг ёс зүйтэй явуулах", 
         d: "Хэрэглэгчдийн хэрэгцээг бүтээгдэхүүн, үйлчилгээгээр хангах",
         correct: "a",
    },
    {
        question: "5.Компани орон нутгийн сургуульд бэлэн мөнгө хандив өгөхөд энэ нь ____ жишээ юм",
         a: "Буяны хандив",
         b: "Гэмт хэргийг бууруулах хөтөлбөр", 
         c: "Байгалийн хэлбэрээр оруулсан хувь нэмэр", 
         d: "Стратегийн филантропи",
         correct: "a",
    },
    {
        question: "6.Зар сурталчилгаанд хоёрдмол утгатай зүйлийг ашиглахтай холбоотой дараахь зүйлсийн аль нь үнэн вэ?",
         a: "Хэрэглэгчдийг бүтээгдэхүүн худалдаж авахад итгүүлэхийн тулд тодорхой үг хэллэгийг ашигладаг",
         b: "Үүнийг хуурамч сурталчилгаа гэж нэрлэдэг", 
         c: "Энэ бол хуурамч зар сурталчилгааны янз бүрийн арга хэрэгслийг ашиглах явдал юм", 
         d: "Энэ нь бүтээгдэхүүнийг олон нийтэд зарах нь ёс зүйгүй, ёс суртахуунгүй арга юм",
         correct: "d",
    },
    {
        question: "7.Эдгээрийн аль нь нууцлалын бодлогын тодорхойлолт вэ?",
         a: "Компани технологийн мэдээллийг хэрхэн олж авах, хадгалах, дүн шинжилгээ хийх талаар тодруулсан хууль ёсны мэдэгдэл.",
         b: "Програм хангамжийг лицензгүйгээр ашиглахыг зөвшөөрсөн хууль ёсны мэдэгдэл", 
         c: "Аюулгүй байдлын мэргэжилтнүүд хакеруудыг нүүр будалтын вэбсайтад татан оруулах зорилгоор ашигладаг системийг хамарсан хууль ёсны мэдэгдэл",
         d: "Аль ч биш",
         correct: "a",
    },
    {
        question: "8.Эдгээрийн аль нь зохиогчийн эрхийг зөрчсөн жишээ юм бэ?",
         a: "Үйлчлүүлэгчдийн мэдээллийг зөвшөөрөлгүйгээр хуваалцах",
         b: "Эзэмшигчийн мэдээллийг баталгаагүй сүлжээгээр дамжуулах", 
         c: "Өөр компанид хамаарах зургийг зөвшөөрөлгүйгээр ашиглах",
         d: "Програмыг лицензгүйгээр ашиглах",
         correct: "c",
    },
    {
        question: "9.Браунын бизнесийн хандивууд орон нутгийн сургуульд компьютер ашигладаг байсан. Энэ ямар жишээ вэ?",
         a: "Эдийн засгийн хариуцлага",
         b: "Филанттрофийн хариуцлага", 
         c: "Хууль эрх зүйн хариуцлага",
         d: "Ёс зүйн хариуцлага",
         correct: "b",
    },
    {
        question: "10.Дараахь зүйлсийн аль нь хамтын харилцааг хамгийн сайн тодорхойлдог вэ?",
         a: "Компани их сургуульд дамжуулж судалгааны төсөл дээр ажиллахаар их сургуульд мөнгө санал болгодог.",
         b: "Хоёр компани цугларч илүү их мөнгө олох, нөөц хуваалцахаар болжээ", 
         c: "Олон хүмүүс орон нутгийн буяны ажилд цаг заваа хандивлахад",
         d: "Хувь хүн орон нутгийн буяны ажилд их хэмжээний мөнгө хандивлахад",
         correct: "a",
    },

];

const quiz = document.getElementById("quiz")

const answerEls = document.querySelectorAll('.answer')

const questionEl = document.getElementById('question')
const a_text = document.getElementById('a_text')
const b_text = document.getElementById('b_text')
const c_text = document.getElementById('c_text')
const d_text = document.getElementById('d_text')



// end utga awch bn ene hamagu
const submitBtn = document.getElementById('submit')


let currentQuiz = 0
let score = 0

loadQuiz()


function loadQuiz(){

    deselectAnswers()

    const currentQuizData = quizData[currentQuiz]

    questionEl.innerText = currentQuizData.question

    a_text.innerText = currentQuizData.a        
    b_text.innerText = currentQuizData.b
    c_text.innerText = currentQuizData.c
    d_text.innerText = currentQuizData.d

}

function deselectAnswers() {

    answerEls.forEach(answerEl => answerEl.checked = false)

}

function getSelected() {
    let answer
    answerEls.forEach(answerEl => {

        if(answerEl.checked) {
            answer = answerEl.id
        }
    })
    return answer;
}


submitBtn.addEventListener('click', () => {

    const answer = getSelected()

    if(answer) {
        if (answer === quizData[currentQuiz].correct){
            score++
        }


        currentQuiz++


        if(currentQuiz < quizData.length) {
            loadQuiz()
        } else {
            
            quiz.innerHTML = `<h2> Асуултууд ${score}/${quizData.length} хариулт зөв</h2>
            
                              <button onclick="location.reload()">Мэдлэгээ Ахин Шалгах </button>`
        }
    }

});
